Repository: xurenlu/someai
Catalog: someai/Localizable.xcstrings
Source language: en
Languages: zh_hans

# chat_history.empty_desc
source: Start a new chat to see it here.
zh_hans: 开始新对话后，历史将显示在此处。

# chat_history.empty_title
source: No chat history
zh_hans: 暂无聊天记录

# chat_history.messages
source: messages
zh_hans: 条消息

# chat_history.untitled
source: Untitled
zh_hans: 未命名

# chat_hub.history
source: History
zh_hans: 历史记录

# chat_hub.new_chat
source: New Chat
zh_hans: 新建聊天

# chat.input_placeholder
source: Type a message...
zh_hans: 输入消息...

# chat.model
source: Model
zh_hans: 模型

# chat.model_loaded
source: Model loaded. Sending message...
zh_hans: 模型已加载完成，正在发送...

# chat.model_loading
source: Loading model...
zh_hans: 正在加载模型...

# chat.placeholder.desc
source: Coming in M2
zh_hans: M2 版本推出

# chat.placeholder.title
source: Chat
zh_hans: 对话

# create.select_tool
source: Select a tool
zh_hans: 选择工具

# create.select_tool_desc
source: Choose Chat, TTS, Voice Chat, or Image from the sidebar.
zh_hans: 从侧栏选择对话、TTS、语音聊天或文生图。

# create.title
source: Create
zh_hans: 创作中心

# history.detail_meta
source: Metadata
zh_hans: 元信息

# history.detail_params
source: Parameters
zh_hans: 请求参数

# history.detail_title
source: Record details
zh_hans: 记录详情

# history.empty_desc
source: Generated content will appear here.
zh_hans: 生成内容将显示在此处。

# history.empty_title
source: No history yet
zh_hans: 暂无历史

# history.filter_all
source: All
zh_hans: 全部

# history.filter_kind
source: Type
zh_hans: 类型

# history.filter_status
source: Status
zh_hans: 状态

# history.kind.chat
source: Chat
zh_hans: 对话

# history.kind.image
source: Image
zh_hans: 文生图

# history.kind.ocr
source: OCR
zh_hans: 文字识别

# history.kind.tts
source: TTS
zh_hans: 语音合成

# history.kind.voiceChat
source: Voice Chat
zh_hans: 语音聊天

# history.open
source: Open
zh_hans: 打开

# history.regenerate
source: Regenerate
zh_hans: 重样生成

# history.retry
source: Retry
zh_hans: 重发

# history.search_placeholder
source: Search...
zh_hans: 搜索...

# history.select_item
source: Select an item
zh_hans: 选择一项

# history.status.failed
source: Failed
zh_hans: 失败

# history.status.success
source: Success
zh_hans: 成功

# history.title
source: History
zh_hans: 历史中心

# image.generate
source: Generate
zh_hans: 生成

# image.generating
source: Generating...
zh_hans: 生成中...

# image.height
source: H
zh_hans: 高

# image.placeholder.desc
source: Coming in M4
zh_hans: M4 版本推出

# image.placeholder.title
source: Image
zh_hans: 文生图

# image.prompt_placeholder
source: Describe the image to generate
zh_hans: 描述要生成的图像

# image.save
source: Save
zh_hans: 保存

# image.width
source: W
zh_hans: 宽

# model_manager.add_model
source: Add from HuggingFace
zh_hans: 从 HuggingFace 添加

# model_manager.add_model_add
source: Add
zh_hans: 添加

# model_manager.add_model_hf_repo
source: HuggingFace Repository
zh_hans: HuggingFace 仓库

# model_manager.add_model_hf_repo_placeholder
source: e.g. Qwen/Qwen2.5-0.5B-Instruct
zh_hans: 例如 Qwen/Qwen2.5-0.5B-Instruct

# model_manager.add_model_invalid_repo
source: HuggingFace repo must be in format org/repo-name
zh_hans: HuggingFace 仓库格式需为 org/repo-name

# model_manager.add_model_name
source: Display Name (optional)
zh_hans: 显示名称（可选）

# model_manager.add_model_title
source: Add Custom Model
zh_hans: 添加自定义模型

# model_manager.add_model_type
source: Model Type
zh_hans: 模型类型

# model_manager.cancel
source: Cancel
zh_hans: 取消

# model_manager.copied
source: Copied
zh_hans: 已复制

# model_manager.copy_diagnostics
source: Copy diagnostics
zh_hans: 复制诊断信息

# model_manager.delete
source: Delete
zh_hans: 删除

# model_manager.delete_confirm_message
source: Delete "%@"? You can re-download it later.
zh_hans: 删除「%@」？删除后可重新下载。

# model_manager.delete_confirm_title
source: Delete Model
zh_hans: 删除模型

# model_manager.download
source: Download
zh_hans: 下载

# model_manager.error_label
source: Error
zh_hans: 错误

# model_manager.error.connection_refused
source: Unable to connect to server. Engine is not ready yet.
zh_hans: 无法连接服务器，引擎尚未就绪。

# model_manager.error.engine_dir_not_found
source: Engine directory not found. Please reinstall app resources or check project layout.
zh_hans: 未找到引擎目录。请检查应用资源或项目目录结构。

# model_manager.error.engine_exited
source: Engine process exited unexpectedly (code: %d).
zh_hans: 引擎进程异常退出（退出码：%d）。

# model_manager.error.engine_not_ready
source: Engine is not ready on port %d. It may have failed to start.
zh_hans: 引擎在端口 %d 尚未就绪，可能启动失败。

# model_manager.error.engine_start_failed_with_stderr
source: Engine start failed: %@
zh_hans: 引擎启动失败：%@

# model_manager.error.not_connected
source: Not connected to network.
zh_hans: 未连接网络。

# model_manager.error.port_in_use_by_process
source: Port %d is in use by: %@
zh_hans: 端口 %d 已被占用：%@

# model_manager.error.pyproject_not_found
source: pyproject.toml not found in project directory. Please run from project root or reinstall the app.
zh_hans: 项目目录缺少 pyproject.toml。请从项目根目录运行或重新安装应用。

# model_manager.error.python_not_found
source: Neither uv nor Python is available. Please install Python 3 or uv first.
zh_hans: 未检测到 uv 或 Python。请先安装 Python 3 或 uv。

# model_manager.error.timeout
source: Request timed out.
zh_hans: 请求超时。

# model_manager.error.uv_sync_failed
source: Environment setup failed (uv sync): %@
zh_hans: 环境初始化失败（uv sync）：%@

# model_manager.health
source: Health
zh_hans: 健康状况

# model_manager.kill_and_retry
source: Kill process and retry
zh_hans: 结束占用进程并重试

# model_manager.models_header
source: Models
zh_hans: 模型

# model_manager.open_in_finder
source: Open in Finder
zh_hans: 在 Finder 中打开

# model_manager.open_models_root
source: Models folder
zh_hans: 模型目录

# model_manager.open_models_root_help
source: Open models storage folder in Finder
zh_hans: 在 Finder 中打开模型存储目录

# model_manager.open_settings
source: Open Settings
zh_hans: 打开设置

# model_manager.port_occupied_by
source: Port occupied by: %@
zh_hans: 端口占用进程：%@

# model_manager.preparing
source: Setting up environment (uv sync)...
zh_hans: 自动修复中（uv sync）...

# model_manager.retry
source: Retry
zh_hans: 重试

# model_manager.status_header
source: Status
zh_hans: 状态

# model_manager.status.engine_running
source: Engine running
zh_hans: 引擎运行中

# model_manager.status.engine_stopped
source: Engine stopped
zh_hans: 引擎已停止

# model_manager.type.image
source: Image
zh_hans: 图像

# model_manager.type.llm
source: LLM
zh_hans: 大语言模型

# model_manager.type.ocr
source: OCR
zh_hans: 文字识别

# model_manager.type.other
source: Other
zh_hans: 其他

# model_manager.type.stt
source: Speech-to-Text
zh_hans: 语音转文字

# model_manager.type.tts
source: Text-to-Speech
zh_hans: 文字转语音

# model_manager.type.vision
source: Vision
zh_hans: 视觉

# ocr.clear
source: Clear
zh_hans: 清除

# ocr.copy
source: Copy
zh_hans: 复制

# ocr.placeholder
source: Select an image to recognize text
zh_hans: 选择图片以识别文字

# ocr.recognize
source: Recognize
zh_hans: 识别

# ocr.recognizing
source: Recognizing...
zh_hans: 识别中...

# ocr.result
source: Result
zh_hans: 识别结果

# ocr.save
source: Save
zh_hans: 保存

# ocr.select_image
source: Select Image
zh_hans: 选择图片

# settings.api_docs
source: API Documentation
zh_hans: API 文档

# settings.browse
source: Browse
zh_hans: 浏览

# settings.engine
source: Engine
zh_hans: 引擎

# settings.engine_footer
source: Port: 1024–65535. Memory limit (MB): 0 = no limit. Restart engine after change.
zh_hans: 端口：1024–65535。内存上限（MB）：0 表示不限制。修改后需重启引擎。

# settings.engine_port
source: Port
zh_hans: 端口

# settings.engine_port_footer
source: Engine API port (1024–65535). Restart engine after change.
zh_hans: 引擎 API 端口（1024–65535）。修改后需重启引擎。

# settings.general
source: General
zh_hans: 通用

# settings.image_timeout
source: Image Generation Timeout
zh_hans: 图片生成超时

# settings.image_timeout_placeholder
source: Seconds
zh_hans: 秒

# settings.llm_timeout
source: LLM Generation Timeout
zh_hans: LLM 生成超时

# settings.llm_timeout_placeholder
source: Seconds
zh_hans: 秒

# settings.llms_txt_error
source: Engine not running. Start the engine to view API documentation.
zh_hans: 引擎未运行。请先启动引擎以查看 API 文档。

# settings.llms_txt_footer
source: LLM-friendly API manifest. Requires engine to be running.
zh_hans: 面向 LLM 的 API 清单。需先启动引擎。

# settings.llms_txt_open_browser
source: Open in Browser
zh_hans: 在浏览器中打开

# settings.memory_limit_mb
source: Memory limit (MB)
zh_hans: 内存上限 (MB)

# settings.memory_limit_placeholder
source: 0 = no limit
zh_hans: 0 = 不限制

# settings.mic_denied
source: Denied
zh_hans: 已拒绝

# settings.mic_footer
source: Microphone is required for Voice Chat.
zh_hans: 语音聊天需要麦克风权限。

# settings.mic_granted
source: Granted
zh_hans: 已授权

# settings.mic_permission
source: Microphone
zh_hans: 麦克风

# settings.mic_undetermined
source: Not requested
zh_hans: 未请求

# settings.model_download_timeout
source: Model Download Timeout
zh_hans: 模型下载超时

# settings.model_download_timeout_placeholder
source: Seconds
zh_hans: 秒

# settings.model_idle_timeout
source: Model idle timeout (min)
zh_hans: 模型空闲超时 (分钟)

# settings.model_load_timeout
source: Model Load Timeout
zh_hans: 模型加载超时

# settings.model_load_timeout_placeholder
source: Seconds
zh_hans: 秒

# settings.open_system_prefs
source: Open System Settings
zh_hans: 打开系统设置

# settings.output
source: Output
zh_hans: 输出

# settings.output_directory
source: Output directory
zh_hans: 输出目录

# settings.output_directory_placeholder
source: e.g. ~/Downloads/someai
zh_hans: 例如 ~/Downloads/someai

# settings.output_footer
source: TTS audio, images, and other generated files are saved here.
zh_hans: TTS 音频、图片等生成文件将保存到此目录。

# settings.permissions
source: Permissions
zh_hans: 权限

# settings.request_mic
source: Request
zh_hans: 申请

# settings.seconds
source: seconds
zh_hans: 秒

# settings.sync_deps
source: Sync dependencies
zh_hans: 同步依赖

# settings.sync_deps_failed
source: Sync failed
zh_hans: 同步失败

# settings.sync_deps_success
source: Sync completed
zh_hans: 同步完成

# settings.syncing_deps
source: Syncing...
zh_hans: 同步中...

# settings.use_china_mirror
source: Use China PyPI mirror (faster in China)
zh_hans: 使用中国 PyPI 镜像（国内加速）

# settings.version
source: Version
zh_hans: 版本

# settings.view_llms_txt
source: View llms.txt
zh_hans: 查看 llms.txt

# sidebar.chat
source: Chat
zh_hans: 对话

# sidebar.chat_hub
source: Chat
zh_hans: 聊天

# sidebar.create_hub
source: Create
zh_hans: 创作中心

# sidebar.history
source: History
zh_hans: 历史记录

# sidebar.history_hub
source: History
zh_hans: 历史中心

# sidebar.image
source: Image
zh_hans: 文生图

# sidebar.image_gen
source: Image Generation
zh_hans: 文生图

# sidebar.model_manager
source: Model Manager
zh_hans: 模型管理

# sidebar.ocr
source: OCR
zh_hans: 文字识别

# sidebar.section.features
source: Features
zh_hans: 功能

# sidebar.section.system
source: System
zh_hans: 系统

# sidebar.settings
source: Settings
zh_hans: 设置

# sidebar.speech_to_text
source: Speech to Text
zh_hans: 语音识别

# sidebar.text_to_speech
source: Text to Speech
zh_hans: 语音合成

# sidebar.tts
source: TTS
zh_hans: 语音合成

# sidebar.voice_assistant
source: Voice Assistant
zh_hans: 语音助手

# sidebar.voice_chat
source: Voice Chat
zh_hans: 语音聊天

# stt.auto_select
source: Auto Select
zh_hans: 自动选择

# stt.browse
source: Browse
zh_hans: 浏览

# stt.copy
source: Copy
zh_hans: 复制

# stt.description
source: Convert audio files to text
zh_hans: 将音频文件转换为文字

# stt.model
source: Model
zh_hans: 模型

# stt.remove
source: Remove
zh_hans: 移除

# stt.select_audio
source: Select Audio File
zh_hans: 选择音频文件

# stt.title
source: Speech to Text
zh_hans: 语音识别

# stt.transcribe
source: Transcribe
zh_hans: 转录

# stt.transcript
source: Transcript
zh_hans: 转录文本

# tts.generating
source: Generating...
zh_hans: 生成中...

# tts.input_placeholder
source: Enter text to convert to speech
zh_hans: 输入要转换的文本

# tts.lang_en
source: English
zh_hans: 英文

# tts.lang_zh
source: Chinese
zh_hans: 中文

# tts.language
source: Language
zh_hans: 语言

# tts.placeholder.desc
source: Coming in M2
zh_hans: M2 版本推出

# tts.placeholder.title
source: TTS
zh_hans: 语音合成

# tts.play
source: Play
zh_hans: 播放

# tts.save
source: Save
zh_hans: 保存

# tts.speaker
source: Speaker
zh_hans: 说话人

# tts.speaker_default
source: Default
zh_hans: 默认

# voice_assistant.auto
source: Auto
zh_hans: 自动

# voice_assistant.description
source: Speak naturally, get intelligent voice responses
zh_hans: 自然对话，智能语音回应

# voice_assistant.llm_model
source: LLM
zh_hans: 语言模型

# voice_assistant.response
source: Response
zh_hans: 回复

# voice_assistant.response_placeholder
source: AI response will appear here...
zh_hans: AI 回复将显示在这里...

# voice_assistant.save
source: Save to History
zh_hans: 保存到历史

# voice_assistant.start
source: Start Conversation
zh_hans: 开始对话

# voice_assistant.stt_model
source: STT
zh_hans: 语音识别

# voice_assistant.tap_to_speak
source: Tap the microphone button to start speaking...
zh_hans: 点击麦克风按钮开始说话...

# voice_assistant.title
source: Voice Assistant
zh_hans: 语音助手

# voice_assistant.tts_model
source: TTS
zh_hans: 语音合成

# voice_assistant.you_said
source: You said
zh_hans: 您说的

# voice_chat.placeholder.desc
source: Coming in M3
zh_hans: M3 版本推出

# voice_chat.placeholder.title
source: Voice Chat
zh_hans: 语音聊天

# voice_chat.processing
source: Processing...
zh_hans: 处理中...

# voice_chat.record
source: Tap to record
zh_hans: 点击录音

# voice_chat.stop
source: Tap to stop
zh_hans: 点击停止
